# taps
# tap "homebrew/core"
# tap "homebrew/cask"
tap "homebrew/bundle"
# tap "homebrew/cask-fonts" # 從舊腳本中提取，可選

# CLI tools

# zsh
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "zoxide"

# k8s
brew "kubernetes-cli"
brew "kustomize"
brew "k9s"
brew "kubectx"
brew "helm"
brew "k3d"

# devops
brew "git"
brew "jq"
brew "tree"
brew "htop"
brew "httpie"
brew "bat"
brew "uv"
brew "terraform"
brew "gh"

# aws
# saml2aws
# eksctl

# others
brew "wget"
brew "curl"

# Applications
cask "google-chrome"
cask "visual-studio-code"
cask "gcloud-cli"

# Optional: Add more packages as needed